# task1 Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік (можно використати константу або функцію input()).
# - якщо користувачу менше 7 - вивести "Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) - вивести "Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "А білетів вже немає!"

user_age = int(input("Введіть ваш вік в роках: "))

if user_age < 7:
    print("Де твої батьки?")
elif user_age < 16:
    print("Це фільм для дорослих!")
elif user_age > 65:
    print("Покажіть пенсійне посвідчення!")
elif str(user_age)[0] == str(user_age)[1]:
    print("Який цікавий вік!")
else:
    print("А білетів вже немає!")