"""
Завдання 1
Макс 20 балів
написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в
двох циклах вводу, а саме... (сформувати строку, використовуючи join)
якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового

врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено,
що ці перевірки не потрібні.
не потрібно перевіряти введення цифр
ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"

В той же час врахуйте, що користувач може вводити дані в різних регістрах

використати сети!!!
"""

visited_places = set(input("Введіть через пробіл міста, в яких Ви були за минулі 10 років: ").casefold().split())
future_places = set(input("Введіть міста, куди Ви хочете поїхати в наступні 10 років: ").casefold().split())

if visited_places.difference(future_places) != visited_places:
    places_string = ', '.join(visited_places.intersection(future_places)).title()
    print(f'Вам напевно дуже сподобалось в наступних містах: {places_string}')
else:
    print("Схоже, Ви відкриті до чогось нового!")

"""
Завдання 2
макс 30 балів
дано код Морзе, що зберігається в словнику
є стрічка, в якій слова розділені 2 пробілами, а букви в слові - одним пробілом
написати програму по декодуванню даної (чи подібної) стрічки
ПІДКАЗКА - при потребі можна створити симетричний словник, де ключами буде код Морзе, а значеннями - символи латиниці
"""
MORSE_CODE_DICT = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
    'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
    'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
    '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----', ', ': '--..--', '.': '.-.-.-',
    '?': '..--..', '/': '-..-.', '-': '-....-', '(': '-.--.', ')': '-.--.-'
}

string_to_decode1 = '..  .-.. .. -.- .  .--. -.-- - .... --- -.  ...-- .-.-.- .---- ----- '
string_to_decode2 = '..  -.- -. --- .-- --..--  -.-- --- ..-  -.-. .- -.  -.. ---  .. - '

DECODE_DICT = {v: k for k, v in MORSE_CODE_DICT.items()}

# Зробив декодування через інпут, а не константою.
# string_to_decode1 = I like python 3.10
# string_to_decode2 = I know, you can do it

user_set = input("Введіть строку для декодування: ").strip().split(" ")
print(user_set)
decoded_symbols_list = []

for i in user_set:
    if i:
        decoded_symbols_list.append(DECODE_DICT.get(i))
    else:
        decoded_symbols_list.append(" ")

decoded_sympols_string = str("".join(str(x) for x in decoded_symbols_list)).casefold().capitalize().replace('  ', ' ')
print(f'Ваша декодована строка: {decoded_sympols_string}')


"""
Завдання 3
макс 50 балів
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку 
здійснюється за механізмом 
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення, 
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер деканату як значення за замовчуванням (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""
student = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 21,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 22,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    }
}

student.update({
    'Леди Гага': {
        'Пошта': 'baba@gmail.com',
        'Вік': 39,
        'Номер телефону': '+380984731221',
        'Середній бал': 99
    }
})

print('Список відмінників:')
for mark in student:
    if student.get(mark).get('Середній бал') > 90:
        print(f'{str(mark)} має {str(student.get(mark).get("Середній бал"))} балів')


print('Середній бал по групі:')
total_mark = 0
marks_counter = 0
for mark in student:
    total_mark += student.get(mark).get('Середній бал')
    marks_counter += 1

total_mark /= marks_counter
print(total_mark)


for mark in student:
    if not student.get(mark).get('Номер телефону'):
        student[mark]['Номер телефону'] = '+380114448877'

print(student)
